<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"339f915880c788223424de12e735e4a63b6092c905c4abd702c85b8c4210b5bb","plan_job_ref":"Job TF Plan #10 at https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4729638198","plan_hash":"88a039ce76588210b7e3be4bb9036f8f4033c9649cc75299a9d340065a34a0e1","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __secure-linux-jump__
With backend config: `resource_group_name=ampe-state-sandbox-resourcegroup-nwqlx-rg
storage_account_name=ampestatesandboxsadojob
container_name=ampe-state-sandbox-sc-ndkad-stct
key=slj.terraform.tfstate`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurenoopsutils_resource_name.snet1a will be destroyed
  # (because azurenoopsutils_resource_name.snet1a is not in configuration)
  - resource "azurenoopsutils_resource_name" "snet1a" {
      - clean_input   = true -> null
      - id            = "nihvcyjgybujwmsh" -> null
      - name          = "subnet1a" -> null
      - passthrough   = false -> null
      - prefixes      = [
          - "AMPE",
          - "dev",
          - "linux-vm",
        ] -> null
      - random_length = 5 -> null
      - resource_type = "azurerm_subnet" -> null
      - result        = "AMPE-dev-linux-vm-subnet1a-mrasf-snet" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [] -> null
      - use_slug      = true -> null
    }

  # azurerm_bastion_host.azbas will be created
  + resource "azurerm_bastion_host" "azbas" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "AMPE-dev-linux-vm-azure-bastion-pgyul-bast"
      + resource_group_name    = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = "*****************************************************************************************************************************************************************************************"
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_subnet.bastionsnet will be created
  + resource "azurerm_subnet" "bastionsnet" {
      + address_prefixes                               = [
          + "10.0.0.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + virtual_network_name                           = "AMPE-dev-linux-vm-virtualnet1-fltei-vnet"
    }

  # azurerm_subnet.snet1a will be destroyed
  # (because azurerm_subnet.snet1a is not in configuration)
  - resource "azurerm_subnet" "snet1a" {
      - address_prefixes                               = [
          - "10.0.0.0/27",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/AMPE-dev-linux-vm-resourcegroup-bmcjn-rg/providers/Microsoft.Network/virtualNetworks/AMPE-dev-linux-vm-virtualnet1-fltei-vnet/subnets/AMPE-dev-linux-vm-subnet1a-mrasf-snet" -> null
      - name                                           = "AMPE-dev-linux-vm-subnet1a-mrasf-snet" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "AMPE-dev-linux-vm-virtualnet1-fltei-vnet" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #10](https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4729638198)